app/Controllers/ClubMemberDashboard.php

SELECT *
FROM `clubmember`
WHERE `clubmember`.`MemberID` = '6'
---
    public function index()
    {
        //instance of club member model
        //will be used to get their first name for display purposes based on session
        $clubMemberModel = new ClubMemberModel();
        $memberID = session()->get('user_id');
        $member = $clubMemberModel->find($memberID);