app/Controllers/StaffDashboard.php

SELECT *
FROM `staff`
WHERE `staff`.`StaffID` = '5'
---
    public function index()
    {
        //instance of staff model
        //will be used to get their first name for display purposes based on session
        $staffModel = new StaffModel();
        $staffID = session()->get('staff_id');
        $staff = $staffModel->find($staffID);