app/Models/AppointmentModel.php

    public function bookAppointment($data)
    {
        //insert new appointment into wefit_db
        return $this->insert($data);
---
INSERT INTO `appointment` (`MemberID`, `StaffID`, `ServiceID`, `AppointmentDate`, `AppointmentTime`, `Details`) VALUES ('6', 5, 9, '2024-04-29', '13:00', 'blah blah')

    public function viewAppointments($memberID)
    {
        return $this -> select('appointment.*, service.ServiceName, staff.FirstName, staff.LastName')
        ->join('service', 'service.ServiceID = appointment.ServiceID')
        ->join('staff', 'staff.StaffID = appointment.StaffID')
        ->where('appointment.MemberID', $memberID)
        ->where('AppointmentDate >=', date('Y-m-d'))
        ->findAll();
---
SELECT `appointment`.*, `service`.`ServiceName`, `staff`.`FirstName`, `staff`.`LastName`
FROM `appointment`
JOIN `service` ON `service`.`ServiceID` = `appointment`.`ServiceID`
JOIN `staff` ON `staff`.`StaffID` = `appointment`.`StaffID`
WHERE `appointment`.`MemberID` = '6'
AND `AppointmentDate` >= '2024-04-27'

    public function viewStaffAppointments($staffID)
    {
        return $this->select('appointment.*, service.ServiceName, clubmember.FirstName, clubmember.LastName')
        ->join('service', 'service.ServiceID = appointment.ServiceID')
        ->join('clubmember', 'clubmember.MemberID = appointment.MemberID')
        ->where('appointment.StaffID', $staffID)
        ->where('AppointmentDate >=', date('Y-m-d'))
        ->findAll();
---
SELECT `appointment`.*, `service`.`ServiceName`, `clubmember`.`FirstName`, `clubmember`.`LastName`
FROM `appointment`
JOIN `service` ON `service`.`ServiceID` = `appointment`.`ServiceID`
JOIN `clubmember` ON `clubmember`.`MemberID` = `appointment`.`MemberID`
WHERE `appointment`.`StaffID` = '5'
AND `AppointmentDate` >= '2024-04-27'