app/Models/ClubMemberModel.php

SELECT *
FROM `clubmember`
WHERE `Email` = 'smith@gmail.com'
 LIMIT 1
---
    public function validateLogin($email, $password)
    {
        //get member by email
        $user = $this->where('Email',$email)->first();