app/Models/StaffModel.php

    public function validateStaffLogin($email, $password)
    {
        //get staff by email
        $staff = $this->where('Email',$email)->first();
---
SELECT *
FROM `staff`
WHERE `Email` = 'smith@gmail.com'
 LIMIT 1